{
  "name": "Incline Dumbbell Flyes - With A Twist",
  "slug": "incline-dumbbell-flyes-with-a-twist",
  "type": "STRENGTH",
  "force": [
    "PUSH"
  ],
  "primaryMuscles": [
    "CHEST"
  ],
  "secondaryMuscles": [
    "FRONT_DELTS"
  ],
  "technicalDifficulty": "beginner",
  "bodyWeightScaling": 0,
  "suggestedMeasurementParadigms": [
    "REP_BASED",
    "AMRAP"
  ],
  "description": "Incline dumbbell fly with twist at top, adding rotation to enhance chest contraction.",
  "instructions": [
    "Hold a dumbbell in each hand and lie on an incline bench that is set to an incline angle of no more than 30 degrees.",
    "Extend your arms above you with a slight bend at the elbows.",
    "Now rotate the wrists so that the palms of your hands are facing you. Tip: The pinky fingers should be next to each other. This will be your starting position.",
    "As you breathe in, start to slowly lower the arms to the side while keeping the arms extended and while rotating the wrists until the palms of the hand are facing each other. Tip: At the end of the movement the arms will be by your side with the palms facing the ceiling.",
    "As you exhale start to bring the dumbbells back up to the starting position by reversing the motion and rotating the hands so that the pinky fingers are next to each other again. Tip: Keep in mind that the movement will only happen at the shoulder joint and at the wrist. There is no motion that happens at the elbow joint.",
    "Repeat for the recommended amount of repetitions."
  ],
  "images": [
    "/img/exercises/Incline_Dumbbell_Flyes_-_With_A_Twist/0.jpg",
    "/img/exercises/Incline_Dumbbell_Flyes_-_With_A_Twist/1.jpg"
  ],
  "alternativeNames": [
    "Incline DB Flyes - With A Twist",
    "Incline Dumbbell Flyes   With A Twist",
    "Incline Dumbell Flyes - With A Twist"
  ],
  "authorName": null,
  "authorUrl": null,
  "createdBy": "system",
  "createdAt": 1760873666,
  "updatedAt": null,
  "version": 0,
  "parentExerciseId": null,
  "templateId": "Incline_Dumbbell_Flyes_-_With_A_Twist",
  "equipmentIds": [
    "2x dumbbell",
    "incline-bench"
  ]
}
