{
  "name": "Kneeling Cable Crunch With Alternating Oblique Twists",
  "slug": "kneeling-cable-crunch-with-alternating-oblique-twists",
  "type": "STRENGTH",
  "force": [
    "PULL",
    "ROTATION"
  ],
  "primary_muscles": [
    "ABS"
  ],
  "secondary_muscles": [],
  "technical_difficulty": "beginner",
  "equipments": [
    "gym-cable-machine"
  ],
  "body_weight_scaling": 0.9,
  "suggested_measurement_paradigms": [
    "REP_BASED"
  ],
  "description": "Kneeling cable crunch adding alternating oblique twists, targeting abs and obliques simultaneously.",
  "instructions": [
    "Connect a rope attachment to a high pulley cable and position a mat on the floor in front of it.",
    "Grab the rope with both hands and kneel approximately two feet back from the tower.",
    "Position the rope behind your head with your hands by your ears.",
    "Keep your hands in the same place, contract your abs and pull downward on the rope in a crunching movement until your elbows reach your knees.",
    "Pause briefly at the bottom and rise up in a slow and controlled manner until you reach the starting position.",
    "Repeat the same downward movement until you're halfway down, at which time you'll begin rotating one of your elbows to the opposite knee.",
    "Again, pause briefly at the bottom and rise up in a slow and controlled manner until you reach the starting position.",
    "Repeat the same movement as before, but alternate the other elbow to the opposite knee.",
    "Continue this series of movements to failure."
  ],
  "images": [
    "/img/exercises/Kneeling_Cable_Crunch_With_Alternating_Oblique_Twists/0.jpg",
    "/img/exercises/Kneeling_Cable_Crunch_With_Alternating_Oblique_Twists/1.jpg"
  ],
  "alternative_names": [
    "Ab Crunch",
    "Abdominal Crunch",
    "Kneeling Cable Crunch With Alternate Oblique Twists",
    "Kneeling Cable Machine Crunch With Alternating Oblique Twists",
    "Kneeling Crunch With Alternating Oblique Twists"
  ],
  "author_name": null,
  "author_url": null,
  "created_by": "system",
  "created_at": 1760873666,
  "updated_at": null,
  "version": 0,
  "parent_exercise_id": null,
  "fork_count": 0,
  "template_id": "Kneeling_Cable_Crunch_With_Alternating_Oblique_Twists"
}
