{
  "name": "Lying Close-Grip Barbell Triceps Press To Chin",
  "slug": "lying-close-grip-barbell-triceps-press-to-chin",
  "type": "STRENGTH",
  "force": [
    "PUSH"
  ],
  "primaryMuscles": [
    "TRICEPS"
  ],
  "secondaryMuscles": [],
  "technicalDifficulty": "intermediate",
  "bodyWeightScaling": 0,
  "suggestedMeasurementParadigms": [
    "REP_BASED"
  ],
  "description": "Lying close-grip barbell press to chin, targeting triceps with partial range pressing movement.",
  "instructions": [
    "While holding a barbell or EZ Curl bar with a pronated grip (palms facing forward), lie on your back on a flat bench with your head off the end of the bench. Tip: If you are holding a barbell grab it using a shoulder-width grip and if you are using an E-Z Bar grab it on the inner handles.",
    "Extend your arms in front of you as you hold the barbell over your chest. The arms should be perpendicular to your torso (90-degree angle). This will be your starting position.",
    "As you inhale, lower the bar in a semi-circular motion by bending at the elbows and while keeping the upper arm stationary and elbows in. Keep lowering the bar until it lightly touches your chin.",
    "As you exhale bring the bar back up to the starting position by pushing the bar up in a semi-circular motion. Contract the triceps hard at the top of the movement for a second. Tip: Again, only the forearms should move. The upper arms should remain stationary at all times.",
    "Repeat for the recommended amount of repetitions."
  ],
  "images": [
    "/img/exercises/Lying_Close-Grip_Barbell_Triceps_Press_To_Chin/0.jpg",
    "/img/exercises/Lying_Close-Grip_Barbell_Triceps_Press_To_Chin/1.jpg"
  ],
  "alternativeNames": [
    "Lying Close Grip Barbell Triceps Press To Chin",
    "Lying Close-Grip BB Triceps Press To Chin",
    "Lying Close-Grip Bar Triceps Press To Chin",
    "Lying Close-Grip Barbell Triceps Press To Chin",
    "Lying Narrow Grip Barbell Triceps Press To Chin",
    "Prone Close-Grip Barbell Triceps Press To Chin"
  ],
  "authorName": null,
  "authorUrl": null,
  "createdBy": "system",
  "createdAt": 1760873666,
  "updatedAt": null,
  "version": 0,
  "parentExerciseId": null,
  "templateId": "Lying_Close-Grip_Barbell_Triceps_Press_To_Chin",
  "equipmentIds": [
    "barbell",
    "ez-bar",
    "bench"
  ]
}
