{
  "name": "Reverse Band Box Squat",
  "slug": "reverse-band-box-squat",
  "type": "STRENGTH",
  "force": [
    "PUSH"
  ],
  "primary_muscles": [
    "QUADS"
  ],
  "secondary_muscles": [
    "GLUTES",
    "HAMSTRINGS"
  ],
  "technical_difficulty": "intermediate",
  "equipments": [
    "barbell",
    "resistance-band",
    "power-rack",
    "box"
  ],
  "body_weight_scaling": 0.4,
  "suggested_measurement_paradigms": [
    "REP_BASED"
  ],
  "description": "Box squat with reverse bands assisting at bottom, allowing heavier loads and training lockout strength.",
  "instructions": [
    "Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar.",
    "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.",
    "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.",
    "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."
  ],
  "images": [
    "/img/exercises/Reverse_Band_Box_Squat/0.jpg",
    "/img/exercises/Reverse_Band_Box_Squat/1.jpg"
  ],
  "alternative_names": [
    "Reverse Resistance Band Box Squat"
  ],
  "author_name": null,
  "author_url": null,
  "created_by": "system",
  "created_at": 1760873666,
  "updated_at": null,
  "version": 0,
  "parent_exercise_id": null,
  "fork_count": 0,
  "template_id": "Reverse_Band_Box_Squat"
}
